000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.     HELLOWORLD.
000300
000400*
000500 PROCEDURE DIVISION.
000600 DISPLAY "SIMPLE HELLO WORLD".
000700 STOP RUN.
