arr = [[0,0,0,0,0,0],
	[0,0,0,0,0,0],
	[0,0,0,0,0,0],
	[0,0,0,0,0,0],
	[0,0,0,0,0,0],
	[0,0,0,0,0,0],];

// 圖形各邊的起點與終點
data = [ [1,2],[2,1],
		[2,3],[2,4],
		[4,3],[4,1]];

for ( i = 0; i < 6; i++) { // 讀取圖形資料
	for ( j = 0; j < 6; j++) { // 填入 arr 矩陣
		tmpi = data[i][0]; // 起始頂點
		tmpj = data[i][1]; // 終止頂點
		arr[tmpi][tmpj] = 1; // 有邊的點填入 1
	}
}
process.stdout.write('有向圖形矩陣 : \n');
for (i = 1; i < 6; i++ ) {
	for (j = 1; j < 6; j++) {
		process.stdout.write('[' + arr[i][j] + ']' ); // Print
	}
	console.log();
}


